tap "benjiwolff/neovim-nightly"
tap "bloznelis/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "nikitabobko/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automate deployment, configuration, and upgrading
brew "ansible"
brew "zsh-autosuggestions"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# CLI and validation tools for Kubelet Container Runtime Interface (CRI)
brew "cri-tools"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# GNU utilities for networking
brew "inetutils", link: false
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", link: false
# Port scanning utility for large networks
brew "nmap"
# AI coding agent, built for the terminal
brew "opencode"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Modern API client that lives in your terminal
brew "posting"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Tab completion for Python argparse
brew "python-argcomplete"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# Passive hostname, domain, and IP lookup tool
brew "wtfis"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Runs `brew install --cask` and runs the command if the Google Cloud cask was installed or upgraded.
cask "google-cloud-sdk", postinstall: "${HOMEBREW_PREFIX}/bin/gcloud components update"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
cask "firefox"
cask "firefox@developer-edition"
cask "obsidian"
cask "chatgpt"
cask "telegram-desktop"
cask "raycast"
cask "docker-desktop"
cask "openvpn-connect"
cask "wireshark-app"
cask "vlc"
cask "obs"

cask "yandex-music"
